heroku-push-repo/app/controllers/ideas_controller.rb

  def create
    @idea = Idea.create(idea_params)
---
INSERT INTO "ideas" ("description", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "This is guest post by Mr. debugger"], ["author", "Debugger"], ["created_at", "2018-02-06 13:20:51.407015"], ["updated_at", "2018-02-06 13:20:51.407015"]]

  def edit
    @idea = Idea.find(params[:id])
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

def destroy
  @idea= Idea.find(params[:id])
  @idea.destroy
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "ideas" WHERE "ideas"."id" = ?  [["id", 2]]